// Внизу, вдоль тротуаров, были выставлены кривые зеркала, и каждый мог вдосталь нахохотаться,
// глядя на отражение своей вытянутой, сплюснутой или перекошенной самым неестественным образом физиономии.
// Тут же перед многочисленными столовыми и кафе, прямо на тротуаре, стояли столики.
// Многие коротышки сидели за столиками и ужинали, пили чай, кофе или газированную воду с сиропом,
// ели мороженое или просто закусывали. Некоторые танцевали тут же под музыку, которая гремела со всех сторон.
// Официанты и официантки бегали с подносами между столиками и приносили желающим разные кушанья.

//mirror(type.NORMAL, type.CROOKED)
//reflection(type, person)
//person.laugh()
//table
//interface eat
//person.eat(food)


public class Main {
    public static void main(String[] args) {

    }
}